Repository: thomas-domville/AppleVis
Catalog: AppleVis/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, el, es, fa, fr, he, hi, id, it, ja, ko, nl, pl, pt, ru, sv, th, tr, uk, vi, zh_hans

source: Swipe left on any saved item for quick actions — unsaving it, or downloading, sharing, and marking it played if it's an episode. Prefer the full picture? A long-press opens the complete action menu instead.
ar: مرر لليسار على أي عنصر محفوظ للوصول إلى إجراءات سريعة — مثل إلغاء حفظه، أو تنزيله ومشاركته ووضع علامة "تم التشغيل" عليه إن كان حلقة. تفضل الصورة الكاملة؟ اضغط مطولًا لفتح قائمة الإجراءات الكاملة بدلًا من ذلك.
de: Wische bei jedem gespeicherten Element nach links, um schnelle Aktionen zu sehen – die Speicherung aufheben oder, bei einer Folge, sie herunterladen, teilen und als abgespielt markieren. Lieber die vollständige Übersicht? Ein langes Drücken öffnet stattdessen das komplette Aktionsmenü.
el: Σύρετε προς τα αριστερά σε οποιοδήποτε αποθηκευμένο στοιχείο για γρήγορες ενέργειες — κατάργηση αποθήκευσης, ή λήψη, κοινοποίηση και επισήμανση ως αναπαραγμένο αν πρόκειται για επεισόδιο. Προτιμάτε την πλήρη εικόνα; Ένα παρατεταμένο πάτημα ανοίγει το πλήρες μενού ενεργειών.
es: Desliza hacia la izquierda en cualquier elemento guardado para ver acciones rápidas: dejar de guardarlo, o descargarlo, compartirlo y marcarlo como reproducido si es un episodio. ¿Prefieres verlo todo? Mantén pulsado para abrir el menú de acciones completo.
fa: روی هر مورد ذخیره‌شده به چپ بکشید تا عملکردهای سریع را ببینید — لغو ذخیره، یا در صورت قسمت بودن، دانلود، اشتراک‌گذاری و علامت‌گذاری به‌عنوان پخش‌شده. تصویر کامل را ترجیح می‌دهید؟ در عوض لمس طولانی، منوی کامل عملکردها را باز می‌کند.
fr: Balayez vers la gauche sur un élément enregistré pour voir des actions rapides — le retirer des enregistrés, ou, s'il s'agit d'un épisode, le télécharger, le partager et le marquer comme lu. Vous préférez la vue complète ? Un appui long ouvre plutôt le menu d'actions complet.
he: החלק שמאלה על כל פריט שמור כדי לראות פעולות מהירות — ביטול שמירה, או הורדה, שיתוף וסימון כהושמע אם מדובר בפרק. מעדיף את התמונה המלאה? לחיצה ארוכה פותחת במקום זאת את תפריט הפעולות המלא.
hi: किसी भी सहेजी गई वस्तु पर बाईं ओर स्वाइप करें ताकि त्वरित कार्रवाइयां दिखें — सेव हटाना, या यदि यह एपिसोड है तो डाउनलोड, शेयर और चलाया हुआ चिह्नित करना। पूरी तस्वीर पसंद है? इसके बजाय देर तक दबाकर पूरा कार्रवाई मेनू खोलें।
id: Geser ke kiri pada item tersimpan mana pun untuk tindakan cepat — membatalkan simpanannya, atau mengunduh, membagikan, dan menandainya sebagai diputar jika berupa episode. Lebih suka tampilan lengkap? Tekan lama untuk membuka menu tindakan lengkap.
it: Scorri verso sinistra su un elemento salvato per azioni rapide — rimuoverlo dai salvati, oppure, se è un episodio, scaricarlo, condividerlo e contrassegnarlo come riprodotto. Preferisci il quadro completo? Tieni premuto per aprire il menu azioni completo.
ja: 保存済みのアイテムを左にスワイプすると、クイックアクションが表示されます。保存を解除したり、エピソードならダウンロード・共有・再生済みにするなどの操作ができます。すべてをまとめて見たい場合は、長押しで完全なアクションメニューを開けます。
ko: 저장된 항목을 왼쪽으로 스와이프하면 빠른 작업이 나타납니다 — 저장 취소, 또는 에피소드라면 다운로드, 공유, 재생됨으로 표시까지 가능합니다. 전체 메뉴를 원하시나요? 길게 눌러 전체 작업 메뉴를 열어 보세요.
nl: Veeg naar links op een opgeslagen item voor snelle acties — het uit opgeslagen verwijderen, of als het een aflevering is, downloaden, delen en als afgespeeld markeren. Liever het volledige overzicht? Houd ingedrukt om het volledige actiemenu te openen.
pl: Przesuń palcem w lewo na dowolnym zapisanym elemencie, aby zobaczyć szybkie akcje — usunięcie z zapisanych, a w przypadku odcinka też pobranie, udostępnienie i oznaczenie jako odtworzone. Wolisz pełny obraz? Przytrzymaj, aby otworzyć pełne menu akcji.
pt: Deslize para a esquerda em qualquer item salvo para ver ações rápidas — remover dos salvos, ou, se for um episódio, baixar, compartilhar e marcar como reproduzido. Prefere o quadro completo? Toque e segure para abrir o menu de ações completo.
ru: Проведите влево по любому сохранённому элементу, чтобы увидеть быстрые действия — убрать из сохранённого, а для эпизода — ещё и скачать, поделиться или отметить как прослушанное. Предпочитаете полную картину? Нажмите и удерживайте, чтобы открыть полное меню действий.
sv: Svep vänster på ett sparat objekt för snabba åtgärder — ta bort det från sparat, eller om det är ett avsnitt: ladda ned, dela och markera som spelat. Vill du hellre se allt? Håll nedtryckt för att öppna den fullständiga åtgärdsmenyn istället.
th: ปัดไปทางซ้ายบนรายการที่บันทึกไว้เพื่อดูการดำเนินการด่วน — ยกเลิกการบันทึก หรือหากเป็นตอน ก็ดาวน์โหลด แชร์ และทำเครื่องหมายว่าเล่นแล้วได้ ต้องการเมนูแบบเต็ม? แตะค้างไว้เพื่อเปิดเมนูการดำเนินการทั้งหมดแทน
tr: Kaydedilmiş herhangi bir öğede sola kaydırarak hızlı işlemlere ulaşın — kaydetmeyi kaldırma veya bölümse indirme, paylaşma ve oynatıldı olarak işaretleme. Tüm seçenekleri mi tercih edersiniz? Bunun yerine dokunup basılı tutarak tam işlem menüsünü açın.
uk: Проведіть пальцем ліворуч по будь-якому збереженому елементу, щоб побачити швидкі дії — скасувати збереження, а для епізоду — ще й завантажити, поділитися чи позначити як відтворене. Бажаєте повну картину? Натисніть і утримуйте, щоб відкрити повне меню дій.
vi: Vuốt sang trái trên bất kỳ mục đã lưu nào để xem thao tác nhanh — bỏ lưu, hoặc nếu là tập thì tải xuống, chia sẻ và đánh dấu là đã phát. Muốn xem đầy đủ hơn? Hãy nhấn giữ để mở menu thao tác đầy đủ.
zh_hans: 在任意已保存项目上向左滑动即可查看快捷操作——取消保存，如果是单集，还可以下载、分享或标记为已播放。想查看完整选项？长按即可打开完整的操作菜单。

source: Swipeable Pickers Announce What You Picked
ar: أدوات الاختيار القابلة للتمرير تعلن عمّا اخترته
de: Wischbare Auswahlfelder sagen an, was du ausgewählt hast
el: Τα κυλιόμενα επιλογείς ανακοινώνουν τι επιλέξατε
es: Los selectores deslizables anuncian lo que elegiste
fa: انتخابگرهای قابل‌تعویض با ضربه، آنچه را انتخاب کرده‌اید اعلام می‌کنند
fr: Les sélecteurs à balayer annoncent votre choix
he: בוררים שניתן להחליק בהם מכריזים על מה שבחרת
hi: स्वाइप करने योग्य पिकर अब आपकी चुनी हुई चीज़ बताते हैं
id: Pemilih yang Bisa Digeser Mengumumkan Pilihan Anda
it: I selettori scorrevoli annunciano cosa hai scelto
ja: スワイプ操作できるピッカーが選択内容を読み上げるように
ko: 스와이프 가능한 선택기가 선택한 항목을 알려줍니다
nl: Schuifbare kiezers melden wat je hebt gekozen
pl: Przesuwane pickery ogłaszają, co wybrałeś
pt: Seletores deslizáveis anunciam o que você escolheu
ru: Пролистываемые переключатели озвучивают ваш выбор
sv: Svepbara väljare meddelar vad du valde
th: ตัวเลือกที่ปัดได้จะประกาศสิ่งที่คุณเลือก
tr: Kaydırılabilir Seçiciler Ne Seçtiğinizi Duyuruyor
uk: Перемикачі, які можна гортати, озвучують ваш вибір
vi: Bộ chọn có thể vuốt sẽ thông báo lựa chọn của bạn
zh_hans: 可滑动选择器会播报你选择的内容

source: Swiping up or down on For You's section picker (Saved, Following, Recommended, Queue, Downloads) played the change tone but never spoke which section you landed on — switching sections swaps in an entirely different screen underneath, and that swap was interrupting VoiceOver's usual announcement before it could be heard. Every other swipeable picker in the app only re-filters a list, so this was the one place it happened. Fixed by announcing the new selection explicitly instead. Reported directly.
ar: التمرير لأعلى أو لأسفل على منتقي الأقسام في من أجلك (المحفوظات، المتابَعة، الموصى بها، قائمة الانتظار، التنزيلات) كان يُصدر نغمة التغيير لكنه لم يكن يذكر أبدًا القسم الذي وصلت إليه — تبديل الأقسام يستبدل الشاشة بالكامل تحته، وكان هذا التبديل يقاطع إعلان VoiceOver المعتاد قبل أن يُسمع. كل منتقي آخر قابل للتمرير في التطبيق يعيد تصفية قائمة فقط، لذا كان هذا هو المكان الوحيد الذي يحدث فيه ذلك. تم الإصلاح بالإعلان صراحةً عن الاختيار الجديد بدلاً من ذلك. أُبلغ عنه مباشرة.
de: Ein Wischen nach oben oder unten auf dem Abschnittsauswähler von Für dich (Gespeichert, Abonniert, Empfohlen, Warteliste, Downloads) spielte den Änderungston ab, sagte aber nie, in welchem Abschnitt man gelandet war — der Wechsel des Abschnitts tauscht darunter einen völlig anderen Bildschirm aus, und dieser Wechsel unterbrach die übliche VoiceOver-Ansage, bevor sie zu hören war. Jeder andere wischbare Picker in der App filtert nur eine Liste neu, das war also die einzige Stelle, an der das passierte. Behoben, indem die neue Auswahl jetzt stattdessen ausdrücklich angesagt wird. Direkt gemeldet.
el: Το σάρωμα προς τα πάνω ή κάτω στον επιλογέα ενότητας του Για Εσάς (Αποθηκευμένα, Ακολουθείτε, Προτεινόμενα, Ουρά, Λήψεις) έπαιζε τον ήχο αλλαγής αλλά δεν έλεγε ποτέ σε ποια ενότητα καταλήξατε — η αλλαγή ενότητας αντικαθιστά μια εντελώς διαφορετική οθόνη από κάτω, και αυτή η αλλαγή διέκοπτε τη συνήθη ανακοίνωση του VoiceOver πριν προλάβει να ακουστεί. Κάθε άλλος επιλογέας με σάρωση στην εφαρμογή απλώς φιλτράρει ξανά μια λίστα, οπότε αυτό ήταν το μοναδικό σημείο που συνέβαινε. Διορθώθηκε ανακοινώνοντας ρητά τη νέα επιλογή. Αναφέρθηκε απευθείας.
es: Deslizar hacia arriba o abajo en el selector de sección de Para ti (Guardados, Siguiendo, Recomendados, Cola, Descargas) reproducía el tono de cambio pero nunca decía en qué sección habías caído — cambiar de sección sustituye toda una pantalla distinta debajo, y ese cambio interrumpía el anuncio habitual de VoiceOver antes de que se pudiera oír. Cualquier otro selector deslizable de la app solo vuelve a filtrar una lista, así que este era el único lugar donde ocurría. Solucionado anunciando la nueva selección de forma explícita. Reportado directamente.
fa: کشیدن انگشت به بالا یا پایین روی انتخابگر بخش در برای شما (ذخیره‌شده‌ها، دنبال‌شده‌ها، پیشنهادی‌ها، صف، دانلودها) صدای تغییر را پخش می‌کرد اما هرگز نمی‌گفت به کدام بخش رسیده‌اید — تغییر بخش، صفحه‌ای کاملاً متفاوت را در زیر جایگزین می‌کند، و همین تغییر، اعلام معمول VoiceOver را پیش از شنیده شدن قطع می‌کرد. هر انتخابگر کشیدنی دیگر در برنامه فقط یک فهرست را دوباره فیلتر می‌کند، پس این تنها جایی بود که این اتفاق می‌افتاد. با اعلام صریح انتخاب جدید برطرف شد. مستقیماً گزارش شد.
fr: Balayer vers le haut ou le bas sur le sélecteur de section de Pour vous (Enregistrés, Suivis, Recommandés, File d'attente, Téléchargements) jouait le son de changement mais ne disait jamais sur quelle section on atterrissait — changer de section remplace tout un écran différent en dessous, et ce changement interrompait l'annonce habituelle de VoiceOver avant qu'elle ne soit entendue. Tout autre sélecteur balayable de l'appli ne fait que refiltrer une liste, c'était donc le seul endroit où cela se produisait. Corrigé en annonçant explicitement la nouvelle sélection à la place. Signalé directement.
he: החלקה למעלה או למטה בבורר הקטעים של בשבילך (שמורים, במעקב, מומלצים, תור, הורדות) השמיעה את צליל השינוי אך מעולם לא אמרה לאיזה קטע הגעת — מעבר בין קטעים מחליף מסך שונה לגמרי מתחת, והחלפה זו קטעה את ההכרזה הרגילה של VoiceOver לפני שניתן היה לשמוע אותה. כל בורר אחר הניתן להחלקה באפליקציה רק מסנן מחדש רשימה, כך שזה היה המקום היחיד שבו זה קרה. תוקן על ידי הכרזה מפורשת על הבחירה החדשה במקום זאת. דווח ישירות.
hi: आपके लिए के सेक्शन पिकर (सेव किए गए, फ़ॉलो किए जा रहे, अनुशंसित, कतार, डाउनलोड) पर ऊपर या नीचे स्वाइप करने पर बदलाव की ध्वनि बजती थी, लेकिन यह कभी नहीं बताती थी कि आप किस सेक्शन पर पहुँचे हैं — सेक्शन बदलने पर नीचे एक पूरी तरह से अलग स्क्रीन आ जाती है, और यह बदलाव VoiceOver की सामान्य घोषणा को सुने जाने से पहले ही बाधित कर देता था। ऐप में हर दूसरा स्वाइप करने योग्य पिकर केवल एक सूची को फिर से फ़िल्टर करता है, इसलिए यह एकमात्र जगह थी जहाँ ऐसा होता था। नई पसंद की स्पष्ट रूप से घोषणा करके ठीक कर दिया गया। सीधे रिपोर्ट किया गया।
id: Menggeser ke atas atau bawah pada pemilih bagian Untuk Anda (Disimpan, Diikuti, Direkomendasikan, Antrean, Unduhan) memutar nada perubahan tetapi tidak pernah mengucapkan bagian mana yang Anda tuju — beralih bagian mengganti seluruh layar yang berbeda di bawahnya, dan pergantian itu mengganggu pengumuman VoiceOver biasa sebelum sempat didengar. Setiap pemilih lain yang dapat digeser di aplikasi hanya menyaring ulang daftar, jadi ini satu-satunya tempat hal itu terjadi. Diperbaiki dengan mengumumkan pilihan baru secara eksplisit. Dilaporkan secara langsung.
it: Scorrere verso l'alto o il basso sul selettore di sezione di Per te (Salvati, Seguiti, Consigliati, Coda, Download) riproduceva il suono di cambio ma non diceva mai in quale sezione si era atterrati — cambiare sezione sostituisce un'intera schermata diversa sottostante, e questo cambio interrompeva il consueto annuncio di VoiceOver prima che potesse essere sentito. Ogni altro selettore scorribile dell'app filtra semplicemente di nuovo un elenco, quindi questo era l'unico punto in cui accadeva. Risolto annunciando esplicitamente la nuova selezione. Segnalato direttamente.
ja: 「あなたへ」のセクションピッカーを上下にスワイプすると変更音は鳴るものの、どのセクションに切り替わったかが読み上げられませんでした。セクションを切り替えると下に表示される画面全体が別のものに入れ替わり、その切り替えがVoiceOverの通常のアナウンスを、聞こえる前に中断させていたのです。アプリ内の他のスワイプ可能なピッカーはリストを再フィルタリングするだけなので、これが唯一発生していた箇所でした。新しい選択内容を明示的にアナウンスするよう修正しました。直接報告いただきました。
ko: 나를 위한의 섹션 선택기(저장됨, 팔로우 중, 추천됨, 대기열, 다운로드)에서 위나 아래로 스와이프하면 변경음은 재생되었지만 어느 섹션으로 이동했는지는 전혀 알려주지 않았습니다 — 섹션을 전환하면 그 아래에 완전히 다른 화면이 통째로 바뀌는데, 이 전환이 VoiceOver의 일반적인 안내를 들리기 전에 중단시키고 있었습니다. 앱 내 다른 스와이프 가능한 선택기는 모두 목록을 다시 필터링할 뿐이므로, 이런 문제가 발생한 곳은 여기뿐이었습니다. 대신 새로운 선택을 명시적으로 알려주도록 수정했습니다. 직접 신고되었습니다.
nl: Omhoog of omlaag vegen op de sectiekiezer van Voor jou (Opgeslagen, Gevolgd, Aanbevolen, Wachtrij, Downloads) speelde het wijzigingsgeluid af, maar zei nooit welke sectie je had bereikt — het wisselen van sectie vervangt er een volledig ander scherm onder, en die wissel onderbrak de gebruikelijke VoiceOver-aankondiging voordat die te horen was. Elke andere veegbare kiezer in de app filtert alleen een lijst opnieuw, dus dit was de enige plek waar dit gebeurde. Opgelost door de nieuwe keuze nu expliciet aan te kondigen. Rechtstreeks gemeld.
pl: Przesunięcie w górę lub w dół na selektorze sekcji w Dla Ciebie (Zapisane, Obserwowane, Polecane, Kolejka, Pobrane) odtwarzało dźwięk zmiany, ale nigdy nie mówiło, w której sekcji się wylądowało — zmiana sekcji zastępuje pod spodem cały inny ekran, a ta zmiana przerywała zwykłe ogłoszenie VoiceOver, zanim dało się je usłyszeć. Każdy inny selektor z gestem przesunięcia w aplikacji jedynie filtruje ponownie listę, więc to było jedyne miejsce, w którym to się zdarzało. Naprawione przez jawne ogłaszanie nowego wyboru. Zgłoszone bezpośrednio.
pt: Deslizar para cima ou para baixo no seletor de seção do Para você (Salvos, Seguindo, Recomendados, Fila, Downloads) tocava o tom de mudança, mas nunca dizia em qual seção você havia parado — trocar de seção substitui uma tela inteiramente diferente por baixo, e essa troca interrompia o anúncio habitual do VoiceOver antes que pudesse ser ouvido. Todo outro seletor deslizável do app apenas refiltra uma lista, então esse era o único lugar onde isso acontecia. Corrigido anunciando a nova seleção explicitamente. Reportado diretamente.
ru: Смахивание вверх или вниз на переключателе раздела «Для вас» (Сохранённые, Отслеживаемые, Рекомендованные, Очередь, Загрузки) воспроизводило звук изменения, но никогда не озвучивало, в каком разделе вы оказались — переключение раздела заменяет под ним совершенно другой экран, и эта замена прерывала обычное объявление VoiceOver до того, как его можно было услышать. Любой другой переключатель с жестом смахивания в приложении лишь заново фильтрует список, так что это было единственное место, где это происходило. Исправлено явным объявлением нового выбора. Сообщено напрямую.
sv: Att svepa upp eller ner på sektionsväljaren i För dig (Sparade, Följer, Rekommenderade, Kö, Nedladdningar) spelade ändringsljudet men sa aldrig vilken sektion du hamnade i — att byta sektion ersätter en helt annan skärm underneath, och det bytet avbröt VoiceOvers vanliga meddelande innan det hanns höras. Alla andra svepbara väljare i appen filtrerar bara om en lista, så det här var det enda stället där det hände. Åtgärdat genom att i stället meddela det nya valet explicit. Rapporterat direkt.
th: การปัดขึ้นหรือลงบนตัวเลือกส่วนของ สำหรับคุณ (บันทึกไว้ กำลังติดตาม แนะนำ คิว ดาวน์โหลด) จะเล่นเสียงเปลี่ยนแปลงแต่ไม่เคยพูดว่าคุณอยู่ในส่วนใด — การเปลี่ยนส่วนจะสลับหน้าจอทั้งหมดที่แตกต่างไปโดยสิ้นเชิงด้านล่าง และการสลับนั้นขัดจังหวะการประกาศตามปกติของ VoiceOver ก่อนที่จะได้ยิน ตัวเลือกที่ปัดได้อื่น ๆ ทั้งหมดในแอปเพียงแค่กรองรายการใหม่เท่านั้น ดังนั้นนี่จึงเป็นจุดเดียวที่เกิดเหตุการณ์นี้ แก้ไขแล้วโดยประกาศตัวเลือกใหม่อย่างชัดเจนแทน รายงานโดยตรง
tr: Sizin İçin bölüm seçicisinde (Kaydedilenler, Takip Edilenler, Önerilenler, Sıra, İndirilenler) yukarı veya aşağı kaydırmak değişim sesini çalıyordu ama hangi bölüme geldiğinizi asla söylemiyordu — bölüm değiştirmek altındaki tamamen farklı bir ekranı değiştiriyor ve bu değişim, VoiceOver'ın olağan duyurusunu duyulmadan önce kesintiye uğratıyordu. Uygulamadaki diğer tüm kaydırılabilir seçiciler yalnızca bir listeyi yeniden filtreler, bu yüzden bunun gerçekleştiği tek yer burasıydı. Yeni seçimi açıkça duyurarak düzeltildi. Doğrudan bildirildi.
uk: Проведення пальцем вгору або вниз по перемикачу розділів «Для вас» (Збережені, Відстежувані, Рекомендовані, Черга, Завантаження) відтворювало звук зміни, але ніколи не озвучувало, в якому розділі ви опинилися — перемикання розділу замінює під ним цілком інший екран, і ця заміна переривала звичайне оголошення VoiceOver ще до того, як його можна було почути. Будь-який інший перемикач із жестом проведення в додатку лише повторно фільтрує список, тож це було єдине місце, де це відбувалося. Виправлено, явно оголошуючи новий вибір. Повідомлено напряму.
vi: Vuốt lên hoặc xuống trên bộ chọn phần của Dành cho bạn (Đã lưu, Đang theo dõi, Được đề xuất, Hàng đợi, Tải xuống) phát âm thanh thay đổi nhưng không bao giờ nói bạn đã chuyển đến phần nào — chuyển phần sẽ thay thế toàn bộ một màn hình hoàn toàn khác bên dưới, và việc thay đổi đó đã làm gián đoạn thông báo thông thường của VoiceOver trước khi nó có thể được nghe thấy. Mọi bộ chọn có thể vuốt khác trong ứng dụng chỉ lọc lại một danh sách, vì vậy đây là nơi duy nhất xảy ra điều này. Đã khắc phục bằng cách thông báo rõ ràng lựa chọn mới thay vào đó. Đã được báo cáo trực tiếp.
zh_hans: 在「为您推荐」的分区选择器（已保存、正在关注、推荐、队列、下载）上下滑动时会播放变化提示音，但从不会说出你切换到了哪个分区——切换分区会在下方替换成完全不同的一整个屏幕，而这一替换会在旁白通常的播报被听到之前将其打断。应用中其他所有可滑动的选择器都只是重新筛选列表，所以这是唯一会出现该问题的地方。现已修复：改为明确播报新的选择。经直接报告。
